Revit 2026 API

# ElementPinned Property

---

Identifies if the element has been pinned to prevent changes.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Pinned { get; set; }
```
```vb
Public Property Pinned As Boolean
	Get
	Set
```
```cpp
public:
property bool Pinned {
	bool get ();
	void set (bool value);
}
```
```fsharp
member Pinned : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: Element cannot be pinned or unpinned. |

An element which is pinned may not be moved, and warnings will be issued when an attempt is made to delete it.

#### Reference

Element Class

Autodesk.Revit.DB Namespace